@echo off
cd/
e:
cd DevProjects\jiandax-blog

echo -----------------------------------------------------------------
echo                   进入目录：%~dp0
echo                   运行命令：hugo
echo -----------------------------------------------------------------
echo.
echo.
echo.
hugo
ping -n 2 127.1>nul
echo.
echo.
echo.
echo -----------------------------------------------------------------
echo                   运行命令：hugo server
echo -----------------------------------------------------------------
hugo server